# ModelTextType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelText..::..ModelTextType Property
ModelText Class See Also
---
The type for the model text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ModelTextType ModelTextType { get; set; }
```

Visual Basic
---
```text
Public Property ModelTextType As ModelTextType
	Get
	Set
```

Visual C++
---
```text
public:
property ModelTextType^ ModelTextType {
	ModelTextType^ get ();
	void set (ModelTextType^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when nullNothingnullptra null reference (Nothing in Visual Basic) is assigned to this property. |

# See Also
ModelText Class
Autodesk.Revit.DB Namespace